GopalSaraf/Practicals/PSDL/include/proc/pic18f97j60.inc
// Register: ETXNDH
#define ETXNDH ETXNDH
ETXNDH                                   equ 0EE7h

// Register: ERXST
#define ERXST ERXST
ERXST                                    equ 0EE8h

// Register: ERXSTL
#define ERXSTL ERXSTL
ERXSTL                                   equ 0EE8h

// Register: ERXSTH
#define ERXSTH ERXSTH
ERXSTH                                   equ 0EE9h

// Register: ERXND
#define ERXND ERXND
ERXND                                    equ 0EEAh

// Register: ERXNDL
#define ERXNDL ERXNDL
ERXNDL                                   equ 0EEAh

// Register: ERXNDH
#define ERXNDH ERXNDH
ERXNDH                                   equ 0EEBh

// Register: ERXRDPT
#define ERXRDPT ERXRDPT
ERXRDPT                                  equ 0EECh

// Register: ERXRDPTL
#define ERXRDPTL ERXRDPTL
ERXRDPTL                                 equ 0EECh

// Register: ERXRDPTH
#define ERXRDPTH ERXRDPTH
ERXRDPTH                                 equ 0EEDh

// Register: ERXWRPT
#define ERXWRPT ERXWRPT
ERXWRPT                                  equ 0EEEh

// Register: ERXWRPTL
#define ERXWRPTL ERXWRPTL
ERXWRPTL                                 equ 0EEEh

// Register: ERXWRPTH
#define ERXWRPTH ERXWRPTH
ERXWRPTH                                 equ 0EEFh

// Register: EDMAST
#define EDMAST EDMAST
EDMAST                                   equ 0EF0h

// Register: EDMASTL
#define EDMASTL EDMASTL
EDMASTL                                  equ 0EF0h

// Register: EDMASTH
#define EDMASTH EDMASTH
EDMASTH                                  equ 0EF1h

// Register: EDMAND
#define EDMAND EDMAND
EDMAND                                   equ 0EF2h

// Register: EDMANDL
#define EDMANDL EDMANDL
EDMANDL                                  equ 0EF2h

// Register: EDMANDH
#define EDMANDH EDMANDH
EDMANDH                                  equ 0EF3h

// Register: EDMADST
#define EDMADST EDMADST
EDMADST                                  equ 0EF4h

// Register: EDMADSTL
#define EDMADSTL EDMADSTL
EDMADSTL                                 equ 0EF4h

// Register: EDMADSTH
#define EDMADSTH EDMADSTH
EDMADSTH                                 equ 0EF5h

// Register: EDMACS
#define EDMACS EDMACS
EDMACS                                   equ 0EF6h

// Register: EDMACSL
#define EDMACSL EDMACSL
EDMACSL                                  equ 0EF6h

// Register: EDMACSH
#define EDMACSH EDMACSH
EDMACSH                                  equ 0EF7h

// Register: EIE
#define EIE EIE
EIE                                      equ 0EFBh
// bitfield definitions
EIE_RXERIE_POSN                          equ 0000h
EIE_RXERIE_POSITION                      equ 0000h
EIE_RXERIE_SIZE                          equ 0001h
EIE_RXERIE_LENGTH                        equ 0001h
EIE_RXERIE_MASK                          equ 0001h
EIE_TXERIE_POSN                          equ 0001h
EIE_TXERIE_POSITION                      equ 0001h
EIE_TXERIE_SIZE                          equ 0001h
EIE_TXERIE_LENGTH                        equ 0001h
EIE_TXERIE_MASK                          equ 0002h
EIE_TXIE_POSN                            equ 0003h
EIE_TXIE_POSITION                        equ 0003h
EIE_TXIE_SIZE                            equ 0001h
EIE_TXIE_LENGTH                          equ 0001h
EIE_TXIE_MASK                            equ 0008h
EIE_LINKIE_POSN                          equ 0004h
EIE_LINKIE_POSITION                      equ 0004h
EIE_LINKIE_SIZE                          equ 0001h
EIE_LINKIE_LENGTH                        equ 0001h
EIE_LINKIE_MASK                          equ 0010h
EIE_DMAIE_POSN                           equ 0005h
EIE_DMAIE_POSITION                       equ 0005h
EIE_DMAIE_SIZE                           equ 0001h
EIE_DMAIE_LENGTH                         equ 0001h
EIE_DMAIE_MASK                           equ 0020h
EIE_PKTIE_POSN                           equ 0006h
EIE_PKTIE_POSITION                       equ 0006h
EIE_PKTIE_SIZE                           equ 0001h
EIE_PKTIE_LENGTH                         equ 0001h
EIE_PKTIE_MASK                           equ 0040h
EIE_ETXIE_POSN                           equ 0003h
EIE_ETXIE_POSITION                       equ 0003h
EIE_ETXIE_SIZE                           equ 0001h
EIE_ETXIE_LENGTH                         equ 0001h
EIE_ETXIE_MASK                           equ 0008h

// Register: ESTAT
#define ESTAT ESTAT
ESTAT                                    equ 0EFDh
// bitfield definitions
ESTAT_PHYRDY_POSN                        equ 0000h
ESTAT_PHYRDY_POSITION                    equ 0000h
ESTAT_PHYRDY_SIZE                        equ 0001h
ESTAT_PHYRDY_LENGTH                      equ 0001h
ESTAT_PHYRDY_MASK                        equ 0001h
ESTAT_TXABRT_POSN                        equ 0001h
ESTAT_TXABRT_POSITION                    equ 0001h
ESTAT_TXABRT_SIZE                        equ 0001h
ESTAT_TXABRT_LENGTH                      equ 0001h
ESTAT_TXABRT_MASK                        equ 0002h
ESTAT_RXBUSY_POSN                        equ 0002h
ESTAT_RXBUSY_POSITION                    equ 0002h
ESTAT_RXBUSY_SIZE                        equ 0001h
ESTAT_RXBUSY_LENGTH                      equ 0001h
ESTAT_RXBUSY_MASK                        equ 0004h
ESTAT_BUFER_POSN                         equ 0006h
ESTAT_BUFER_POSITION                     equ 0006h
ESTAT_BUFER_SIZE                         equ 0001h
ESTAT_BUFER_LENGTH                       equ 0001h
ESTAT_BUFER_MASK                         equ 0040h

// Register: ECON2
#define ECON2 ECON2
ECON2                                    equ 0EFEh
// bitfield definitions
ECON2_ETHEN_POSN                         equ 0005h
ECON2_ETHEN_POSITION                     equ 0005h
ECON2_ETHEN_SIZE                         equ 0001h
ECON2_ETHEN_LENGTH                       equ 0001h
ECON2_ETHEN_MASK                         equ 0020h
ECON2_PKTDEC_POSN                        equ 0006h
ECON2_PKTDEC_POSITION                    equ 0006h
ECON2_PKTDEC_SIZE                        equ 0001h
ECON2_PKTDEC_LENGTH                      equ 0001h
ECON2_PKTDEC_MASK                        equ 0040h
ECON2_AUTOINC_POSN                       equ 0007h
ECON2_AUTOINC_POSITION                   equ 0007h
ECON2_AUTOINC_SIZE                       equ 0001h
ECON2_AUTOINC_LENGTH                     equ 0001h
ECON2_AUTOINC_MASK                       equ 0080h

// Register: EIR
#define EIR EIR
EIR                                      equ 0F60h
// bitfield definitions
EIR_RXERIF_POSN                          equ 0000h
EIR_RXERIF_POSITION                      equ 0000h
EIR_RXERIF_SIZE                          equ 0001h
EIR_RXERIF_LENGTH                        equ 0001h
EIR_RXERIF_MASK                          equ 0001h
EIR_TXERIF_POSN                          equ 0001h
EIR_TXERIF_POSITION                      equ 0001h
EIR_TXERIF_SIZE                          equ 0001h
EIR_TXERIF_LENGTH                        equ 0001h
EIR_TXERIF_MASK                          equ 0002h
EIR_TXIF_POSN                            equ 0003h
EIR_TXIF_POSITION                        equ 0003h
EIR_TXIF_SIZE                            equ 0001h
EIR_TXIF_LENGTH                          equ 0001h
EIR_TXIF_MASK                            equ 0008h
EIR_LINKIF_POSN                          equ 0004h
EIR_LINKIF_POSITION                      equ 0004h
EIR_LINKIF_SIZE                          equ 0001h
EIR_LINKIF_LENGTH                        equ 0001h
EIR_LINKIF_MASK                          equ 0010h
EIR_DMAIF_POSN                           equ 0005h
EIR_DMAIF_POSITION                       equ 0005h
EIR_DMAIF_SIZE                           equ 0001h
EIR_DMAIF_LENGTH                         equ 0001h
EIR_DMAIF_MASK                           equ 0020h
EIR_PKTIF_POSN                           equ 0006h
EIR_PKTIF_POSITION                       equ 0006h
EIR_PKTIF_SIZE                           equ 0001h
EIR_PKTIF_LENGTH                         equ 0001h
EIR_PKTIF_MASK                           equ 0040h
EIR_ETXIF_POSN                           equ 0003h
EIR_ETXIF_POSITION                       equ 0003h
EIR_ETXIF_SIZE                           equ 0001h
EIR_ETXIF_LENGTH                         equ 0001h
EIR_ETXIF_MASK                           equ 0008h

// Register: EDATA
#define EDATA EDATA
EDATA                                    equ 0F61h
// bitfield definitions
EDATA_EDATA0_POSN                        equ 0000h
EDATA_EDATA0_POSITION                    equ 0000h
EDATA_EDATA0_SIZE                        equ 0001h
EDATA_EDATA0_LENGTH                      equ 0001h
EDATA_EDATA0_MASK                        equ 0001h
EDATA_EDATA1_POSN                        equ 0001h
EDATA_EDATA1_POSITION                    equ 0001h
EDATA_EDATA1_SIZE                        equ 0001h
EDATA_EDATA1_LENGTH                      equ 0001h
EDATA_EDATA1_MASK                        equ 0002h
EDATA_EDATA2_POSN                        equ 0002h
EDATA_EDATA2_POSITION                    equ 0002h
EDATA_EDATA2_SIZE                        equ 0001h
EDATA_EDATA2_LENGTH                      equ 0001h
EDATA_EDATA2_MASK                        equ 0004h
EDATA_EDATA3_POSN                        equ 0003h
EDATA_EDATA3_POSITION                    equ 0003h
EDATA_EDATA3_SIZE                        equ 0001h
EDATA_EDATA3_LENGTH                      equ 0001h
EDATA_EDATA3_MASK                        equ 0008h
EDATA_EDATA4_POSN                        equ 0004h
EDATA_EDATA4_POSITION                    equ 0004h
EDATA_EDATA4_SIZE                        equ 0001h
EDATA_EDATA4_LENGTH                      equ 0001h
EDATA_EDATA4_MASK                        equ 0010h
EDATA_EDATA5_POSN                        equ 0005h
EDATA_EDATA5_POSITION                    equ 0005h
EDATA_EDATA5_SIZE                        equ 0001h
EDATA_EDATA5_LENGTH                      equ 0001h
EDATA_EDATA5_MASK                        equ 0020h
EDATA_EDATA6_POSN                        equ 0006h
EDATA_EDATA6_POSITION                    equ 0006h
EDATA_EDATA6_SIZE                        equ 0001h
EDATA_EDATA6_LENGTH                      equ 0001h
EDATA_EDATA6_MASK                        equ 0040h
EDATA_EDATA7_POSN                        equ 0007h
EDATA_EDATA7_POSITION                    equ 0007h
EDATA_EDATA7_SIZE                        equ 0001h
EDATA_EDATA7_LENGTH                      equ 0001h
EDATA_EDATA7_MASK                        equ 0080h

// Register: SSP2CON2
#define SSP2CON2 SSP2CON2
SSP2CON2                                 equ 0F62h
// bitfield definitions
SSP2CON2_SEN_POSN                        equ 0000h
SSP2CON2_SEN_POSITION                    equ 0000h
SSP2CON2_SEN_SIZE                        equ 0001h
SSP2CON2_SEN_LENGTH                      equ 0001h
SSP2CON2_SEN_MASK                        equ 0001h
SSP2CON2_RSEN_POSN                       equ 0001h
SSP2CON2_RSEN_POSITION                   equ 0001h
SSP2CON2_RSEN_SIZE                       equ 0001h
SSP2CON2_RSEN_LENGTH                     equ 0001h
SSP2CON2_RSEN_MASK                       equ 0002h
SSP2CON2_PEN_POSN                        equ 0002h
SSP2CON2_PEN_POSITION                    equ 0002h
SSP2CON2_PEN_SIZE                        equ 0001h
SSP2CON2_PEN_LENGTH                      equ 0001h
SSP2CON2_PEN_MASK                        equ 0004h
SSP2CON2_RCEN_POSN                       equ 0003h
SSP2CON2_RCEN_POSITION                   equ 0003h
SSP2CON2_RCEN_SIZE                       equ 0001h
SSP2CON2_RCEN_LENGTH                     equ 0001h
SSP2CON2_RCEN_MASK                       equ 0008h
SSP2CON2_ACKEN_POSN                      equ 0004h
SSP2CON2_ACKEN_POSITION                  equ 0004h
SSP2CON2_ACKEN_SIZE                      equ 0001h
SSP2CON2_ACKEN_LENGTH                    equ 0001h
SSP2CON2_ACKEN_MASK                      equ 0010h
SSP2CON2_ACKDT_POSN                      equ 0005h
SSP2CON2_ACKDT_POSITION                  equ 0005h
SSP2CON2_ACKDT_SIZE                      equ 0001h
SSP2CON2_ACKDT_LENGTH                    equ 0001h
SSP2CON2_ACKDT_MASK                      equ 0020h
SSP2CON2_ACKSTAT_POSN                    equ 0006h
SSP2CON2_ACKSTAT_POSITION                equ 0006h
SSP2CON2_ACKSTAT_SIZE                    equ 0001h
SSP2CON2_ACKSTAT_LENGTH                  equ 0001h
SSP2CON2_ACKSTAT_MASK                    equ 0040h
SSP2CON2_GCEN_POSN                       equ 0007h
SSP2CON2_GCEN_POSITION                   equ 0007h
SSP2CON2_GCEN_SIZE                       equ 0001h
SSP2CON2_GCEN_LENGTH                     equ 0001h
SSP2CON2_GCEN_MASK                       equ 0080h
SSP2CON2_ADMSK1_POSN                     equ 0001h
SSP2CON2_ADMSK1_POSITION                 equ 0001h
SSP2CON2_ADMSK1_SIZE                     equ 0001h
SSP2CON2_ADMSK1_LENGTH                   equ 0001h
SSP2CON2_ADMSK1_MASK                     equ 0002h
SSP2CON2_ADMSK2_POSN                     equ 0002h
SSP2CON2_ADMSK2_POSITION                 equ 0002h
SSP2CON2_ADMSK2_SIZE                     equ 0001h
SSP2CON2_ADMSK2_LENGTH                   equ 0001h
SSP2CON2_ADMSK2_MASK                     equ 0004h
SSP2CON2_ADMSK3_POSN                     equ 0003h
SSP2CON2_ADMSK3_POSITION                 equ 0003h
SSP2CON2_ADMSK3_SIZE                     equ 0001h
SSP2CON2_ADMSK3_LENGTH                   equ 0001h
SSP2CON2_ADMSK3_MASK                     equ 0008h
SSP2CON2_ADMSK4_POSN                     equ 0004h
SSP2CON2_ADMSK4_POSITION                 equ 0004h
SSP2CON2_ADMSK4_SIZE                     equ 0001h
SSP2CON2_ADMSK4_LENGTH                   equ 0001h
SSP2CON2_ADMSK4_MASK                     equ 0010h
SSP2CON2_ADMSK5_POSN                     equ 0005h
SSP2CON2_ADMSK5_POSITION                 equ 0005h
SSP2CON2_ADMSK5_SIZE                     equ 0001h
SSP2CON2_ADMSK5_LENGTH                   equ 0001h
SSP2CON2_ADMSK5_MASK                     equ 0020h
SSP2CON2_ADMSK_POSN                      equ 0001h
SSP2CON2_ADMSK_POSITION                  equ 0001h
SSP2CON2_ADMSK_SIZE                      equ 0005h
SSP2CON2_ADMSK_LENGTH                    equ 0005h
SSP2CON2_ADMSK_MASK                      equ 003Eh
SSP2CON2_SEN2_POSN                       equ 0000h
SSP2CON2_SEN2_POSITION                   equ 0000h
SSP2CON2_SEN2_SIZE                       equ 0001h
SSP2CON2_SEN2_LENGTH                     equ 0001h
SSP2CON2_SEN2_MASK                       equ 0001h
SSP2CON2_RSEN2_POSN                      equ 0001h
SSP2CON2_RSEN2_POSITION                  equ 0001h
SSP2CON2_RSEN2_SIZE                      equ 0001h
SSP2CON2_RSEN2_LENGTH                    equ 0001h
SSP2CON2_RSEN2_MASK                      equ 0002h
SSP2CON2_PEN2_POSN                       equ 0002h
SSP2CON2_PEN2_POSITION                   equ 0002h
SSP2CON2_PEN2_SIZE                       equ 0001h
SSP2CON2_PEN2_LENGTH                     equ 0001h
SSP2CON2_PEN2_MASK                       equ 0004h
SSP2CON2_RCEN2_POSN                      equ 0003h
SSP2CON2_RCEN2_POSITION                  equ 0003h
SSP2CON2_RCEN2_SIZE                      equ 0001h
SSP2CON2_RCEN2_LENGTH                    equ 0001h
SSP2CON2_RCEN2_MASK                      equ 0008h
SSP2CON2_ACKEN2_POSN                     equ 0004h
SSP2CON2_ACKEN2_POSITION                 equ 0004h
SSP2CON2_ACKEN2_SIZE                     equ 0001h
SSP2CON2_ACKEN2_LENGTH                   equ 0001h
SSP2CON2_ACKEN2_MASK                     equ 0010h
SSP2CON2_ACKDT2_POSN                     equ 0005h
SSP2CON2_ACKDT2_POSITION                 equ 0005h
SSP2CON2_ACKDT2_SIZE                     equ 0001h
SSP2CON2_ACKDT2_LENGTH                   equ 0001h
SSP2CON2_ACKDT2_MASK                     equ 0020h
SSP2CON2_ACKSTAT2_POSN                   equ 0006h
SSP2CON2_ACKSTAT2_POSITION               equ 0006h
SSP2CON2_ACKSTAT2_SIZE                   equ 0001h
SSP2CON2_ACKSTAT2_LENGTH                 equ 0001h
SSP2CON2_ACKSTAT2_MASK                   equ 0040h
SSP2CON2_GCEN2_POSN                      equ 0007h
SSP2CON2_GCEN2_POSITION                  equ 0007h
SSP2CON2_GCEN2_SIZE                      equ 0001h
SSP2CON2_GCEN2_LENGTH                    equ 0001h
SSP2CON2_GCEN2_MASK                      equ 0080h
SSP2CON2_ADMSK12_POSN                    equ 0001h
SSP2CON2_ADMSK12_POSITION                equ 0001h
SSP2CON2_ADMSK12_SIZE                    equ 0001h
SSP2CON2_ADMSK12_LENGTH                  equ 0001h
SSP2CON2_ADMSK12_MASK                    equ 0002h
SSP2CON2_ADMSK22_POSN                    equ 0002h
SSP2CON2_ADMSK22_POSITION                equ 0002h
SSP2CON2_ADMSK22_SIZE                    equ 0001h
SSP2CON2_ADMSK22_LENGTH                  equ 0001h
SSP2CON2_ADMSK22_MASK                    equ 0004h
SSP2CON2_ADMSK32_POSN                    equ 0003h
SSP2CON2_ADMSK32_POSITION                equ 0003h
SSP2CON2_ADMSK32_SIZE                    equ 0001h
SSP2CON2_ADMSK32_LENGTH                  equ 0001h
SSP2CON2_ADMSK32_MASK                    equ 0008h
SSP2CON2_ADMSK42_POSN                    equ 0004h
SSP2CON2_ADMSK42_POSITION                equ 0004h
SSP2CON2_ADMSK42_SIZE                    equ 0001h
SSP2CON2_ADMSK42_LENGTH                  equ 0001h
SSP2CON2_ADMSK42_MASK                    equ 0010h
SSP2CON2_ADMSK52_POSN                    equ 0005h
SSP2CON2_ADMSK52_POSITION                equ 0005h
SSP2CON2_ADMSK52_SIZE                    equ 0001h
SSP2CON2_ADMSK52_LENGTH                  equ 0001h
SSP2CON2_ADMSK52_MASK                    equ 0020h

// Register: SSP2CON1
#define SSP2CON1 SSP2CON1
SSP2CON1                                 equ 0F63h
// bitfield definitions
SSP2CON1_SSPM_POSN                       equ 0000h
SSP2CON1_SSPM_POSITION                   equ 0000h
SSP2CON1_SSPM_SIZE                       equ 0004h
SSP2CON1_SSPM_LENGTH                     equ 0004h
SSP2CON1_SSPM_MASK                       equ 000Fh
SSP2CON1_CKP_POSN                        equ 0004h
SSP2CON1_CKP_POSITION                    equ 0004h
SSP2CON1_CKP_SIZE                        equ 0001h
SSP2CON1_CKP_LENGTH                      equ 0001h
SSP2CON1_CKP_MASK                        equ 0010h
SSP2CON1_SSPEN_POSN                      equ 0005h
SSP2CON1_SSPEN_POSITION                  equ 0005h
SSP2CON1_SSPEN_SIZE                      equ 0001h
SSP2CON1_SSPEN_LENGTH                    equ 0001h
SSP2CON1_SSPEN_MASK                      equ 0020h
SSP2CON1_SSPOV_POSN                      equ 0006h
SSP2CON1_SSPOV_POSITION                  equ 0006h
SSP2CON1_SSPOV_SIZE                      equ 0001h
SSP2CON1_SSPOV_LENGTH                    equ 0001h
SSP2CON1_SSPOV_MASK                      equ 0040h
SSP2CON1_WCOL_POSN                       equ 0007h
SSP2CON1_WCOL_POSITION                   equ 0007h
SSP2CON1_WCOL_SIZE                       equ 0001h
SSP2CON1_WCOL_LENGTH                     equ 0001h
SSP2CON1_WCOL_MASK                       equ 0080h
SSP2CON1_SSPM0_POSN                      equ 0000h
SSP2CON1_SSPM0_POSITION                  equ 0000h
SSP2CON1_SSPM0_SIZE                      equ 0001h
SSP2CON1_SSPM0_LENGTH                    equ 0001h
SSP2CON1_SSPM0_MASK                      equ 0001h
SSP2CON1_SSPM1_POSN                      equ 0001h
SSP2CON1_SSPM1_POSITION                  equ 0001h
SSP2CON1_SSPM1_SIZE                      equ 0001h
SSP2CON1_SSPM1_LENGTH                    equ 0001h
SSP2CON1_SSPM1_MASK                      equ 0002h
SSP2CON1_SSPM2_POSN                      equ 0002h
SSP2CON1_SSPM2_POSITION                  equ 0002h
SSP2CON1_SSPM2_SIZE                      equ 0001h
SSP2CON1_SSPM2_LENGTH                    equ 0001h
SSP2CON1_SSPM2_MASK                      equ 0004h
SSP2CON1_SSPM3_POSN                      equ 0003h
SSP2CON1_SSPM3_POSITION                  equ 0003h
SSP2CON1_SSPM3_SIZE                      equ 0001h
SSP2CON1_SSPM3_LENGTH                    equ 0001h
SSP2CON1_SSPM3_MASK                      equ 0008h
SSP2CON1_SSPM02_POSN                     equ 0000h
SSP2CON1_SSPM02_POSITION                 equ 0000h
SSP2CON1_SSPM02_SIZE                     equ 0001h
SSP2CON1_SSPM02_LENGTH                   equ 0001h
SSP2CON1_SSPM02_MASK                     equ 0001h
SSP2CON1_SSPM12_POSN                     equ 0001h
SSP2CON1_SSPM12_POSITION                 equ 0001h
SSP2CON1_SSPM12_SIZE                     equ 0001h
SSP2CON1_SSPM12_LENGTH                   equ 0001h
SSP2CON1_SSPM12_MASK                     equ 0002h
SSP2CON1_SSPM22_POSN                     equ 0002h
SSP2CON1_SSPM22_POSITION                 equ 0002h
SSP2CON1_SSPM22_SIZE                     equ 0001h
SSP2CON1_SSPM22_LENGTH                   equ 0001h
SSP2CON1_SSPM22_MASK                     equ 0004h
SSP2CON1_SSPM32_POSN                     equ 0003h
SSP2CON1_SSPM32_POSITION                 equ 0003h
SSP2CON1_SSPM32_SIZE                     equ 0001h
SSP2CON1_SSPM32_LENGTH                   equ 0001h
SSP2CON1_SSPM32_MASK                     equ 0008h
SSP2CON1_CKP2_POSN                       equ 0004h
SSP2CON1_CKP2_POSITION                   equ 0004h
SSP2CON1_CKP2_SIZE                       equ 0001h
SSP2CON1_CKP2_LENGTH                     equ 0001h
SSP2CON1_CKP2_MASK                       equ 0010h
SSP2CON1_SSPEN2_POSN                     equ 0005h
SSP2CON1_SSPEN2_POSITION                 equ 0005h
SSP2CON1_SSPEN2_SIZE                     equ 0001h
SSP2CON1_SSPEN2_LENGTH                   equ 0001h
SSP2CON1_SSPEN2_MASK                     equ 0020h
SSP2CON1_SSPOV2_POSN                     equ 0006h
SSP2CON1_SSPOV2_POSITION                 equ 0006h
SSP2CON1_SSPOV2_SIZE                     equ 0001h
SSP2CON1_SSPOV2_LENGTH                   equ 0001h
SSP2CON1_SSPOV2_MASK                     equ 0040h
SSP2CON1_WCOL2_POSN                      equ 0007h
SSP2CON1_WCOL2_POSITION                  equ 0007h
SSP2CON1_WCOL2_SIZE                      equ 0001h
SSP2CON1_WCOL2_LENGTH                    equ 0001h
SSP2CON1_WCOL2_MASK                      equ 0080h

