GopalSaraf/Practicals/PSDL/include/proc/pic18f97j60.inc
#define GO_NOT_DONE                      BANKMASK(ADCON0), 1, a
#define GO_nDONE                         BANKMASK(ADCON0), 1, a
#define HFRMEN                           BANKMASK(MACON3), 2, b
#define HTEN                             BANKMASK(ERXFCON), 2, b
#define I2C_DAT2                         BANKMASK(SSP2STAT), 5, a
#define I2C_READ2                        BANKMASK(SSP2STAT), 2, a
#define I2C_START2                       BANKMASK(SSP2STAT), 3, a
#define I2C_STOP2                        BANKMASK(SSP2STAT), 4, a
#define IBF                              BANKMASK(PSPCON), 7, a
#define IBOV                             BANKMASK(PSPCON), 5, a
#define IDLEN                            BANKMASK(OSCCON), 7, a
#define INT0                             BANKMASK(PORTB), 0, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1                             BANKMASK(PORTB), 1, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
#define INT1IF                           BANKMASK(INTCON3), 0, a
#define INT1IP                           BANKMASK(INTCON3), 6, a
#define INT1P                            BANKMASK(INTCON3), 6, a
#define INT2                             BANKMASK(PORTB), 2, a
#define INT2E                            BANKMASK(INTCON3), 4, a
#define INT2F                            BANKMASK(INTCON3), 1, a
#define INT2IE                           BANKMASK(INTCON3), 4, a
#define INT2IF                           BANKMASK(INTCON3), 1, a
#define INT2IP                           BANKMASK(INTCON3), 7, a
#define INT2P                            BANKMASK(INTCON3), 7, a
#define INT3                             BANKMASK(PORTB), 3, a
#define INT3E                            BANKMASK(INTCON3), 5, a
#define INT3F                            BANKMASK(INTCON3), 2, a
#define INT3IE                           BANKMASK(INTCON3), 5, a
#define INT3IF                           BANKMASK(INTCON3), 2, a
#define INT3IP                           BANKMASK(INTCON2), 1, a
#define INTEDG0                          BANKMASK(INTCON2), 6, a
#define INTEDG1                          BANKMASK(INTCON2), 5, a
#define INTEDG2                          BANKMASK(INTCON2), 4, a
#define INTEDG3                          BANKMASK(INTCON2), 3, a
#define IPEN                             BANKMASK(RCON), 7, a
#define KBI0                             BANKMASK(PORTB), 4, a
#define KBI1                             BANKMASK(PORTB), 5, a
#define KBI2                             BANKMASK(PORTB), 6, a
#define KBI3                             BANKMASK(PORTB), 7, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LATD0                            BANKMASK(LATD), 0, a
#define LATD1                            BANKMASK(LATD), 1, a
#define LATD2                            BANKMASK(LATD), 2, a
#define LATD3                            BANKMASK(LATD), 3, a
#define LATD4                            BANKMASK(LATD), 4, a
#define LATD5                            BANKMASK(LATD), 5, a
#define LATD6                            BANKMASK(LATD), 6, a
#define LATD7                            BANKMASK(LATD), 7, a
#define LATE0                            BANKMASK(LATE), 0, a
#define LATE1                            BANKMASK(LATE), 1, a
#define LATE2                            BANKMASK(LATE), 2, a
#define LATE3                            BANKMASK(LATE), 3, a
#define LATE4                            BANKMASK(LATE), 4, a
#define LATE5                            BANKMASK(LATE), 5, a
#define LATE6                            BANKMASK(LATE), 6, a
#define LATE7                            BANKMASK(LATE), 7, a
#define LATF0                            BANKMASK(LATF), 0, a
#define LATF1                            BANKMASK(LATF), 1, a
#define LATF2                            BANKMASK(LATF), 2, a
#define LATF3                            BANKMASK(LATF), 3, a
#define LATF4                            BANKMASK(LATF), 4, a
#define LATF5                            BANKMASK(LATF), 5, a
#define LATF6                            BANKMASK(LATF), 6, a
#define LATF7                            BANKMASK(LATF), 7, a
#define LATG0                            BANKMASK(LATG), 0, a
#define LATG1                            BANKMASK(LATG), 1, a
#define LATG2                            BANKMASK(LATG), 2, a
#define LATG3                            BANKMASK(LATG), 3, a
#define LATG4                            BANKMASK(LATG), 4, a
#define LATG5                            BANKMASK(LATG), 5, a
#define LATG6                            BANKMASK(LATG), 6, a
#define LATG7                            BANKMASK(LATG), 7, a
#define LATH0                            BANKMASK(LATH), 0, a
#define LATH1                            BANKMASK(LATH), 1, a
#define LATH2                            BANKMASK(LATH), 2, a
#define LATH3                            BANKMASK(LATH), 3, a
#define LATH4                            BANKMASK(LATH), 4, a
#define LATH5                            BANKMASK(LATH), 5, a
#define LATH6                            BANKMASK(LATH), 6, a
#define LATH7                            BANKMASK(LATH), 7, a
#define LATJ0                            BANKMASK(LATJ), 0, a
#define LATJ1                            BANKMASK(LATJ), 1, a
#define LATJ2                            BANKMASK(LATJ), 2, a
#define LATJ3                            BANKMASK(LATJ), 3, a
#define LATJ4                            BANKMASK(LATJ), 4, a
#define LATJ5                            BANKMASK(LATJ), 5, a
#define LATJ6                            BANKMASK(LATJ), 6, a
#define LATJ7                            BANKMASK(LATJ), 7, a
#define LB                               BANKMASK(PORTJ), 6, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC3                              BANKMASK(LATC), 3, a
#define LC4                              BANKMASK(LATC), 4, a
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LD0                              BANKMASK(LATD), 0, a
#define LD1                              BANKMASK(LATD), 1, a
#define LD2                              BANKMASK(LATD), 2, a
#define LD3                              BANKMASK(LATD), 3, a
#define LD4                              BANKMASK(LATD), 4, a
#define LD5                              BANKMASK(LATD), 5, a
#define LD6                              BANKMASK(LATD), 6, a
#define LD7                              BANKMASK(LATD), 7, a
#define LE0                              BANKMASK(LATE), 0, a
#define LE1                              BANKMASK(LATE), 1, a
#define LE2                              BANKMASK(LATE), 2, a
#define LE3                              BANKMASK(LATE), 3, a
#define LE4                              BANKMASK(LATE), 4, a
#define LE5                              BANKMASK(LATE), 5, a
#define LE6                              BANKMASK(LATE), 6, a
#define LE7                              BANKMASK(LATE), 7, a
#define LEDA                             BANKMASK(PORTA), 0, a
#define LEDB                             BANKMASK(PORTA), 1, a
#define LF0                              BANKMASK(LATF), 0, a
#define LF1                              BANKMASK(LATF), 1, a
#define LF2                              BANKMASK(LATF), 2, a
#define LF3                              BANKMASK(LATF), 3, a
#define LF4                              BANKMASK(LATF), 4, a
#define LF5                              BANKMASK(LATF), 5, a
#define LF6                              BANKMASK(LATF), 6, a
#define LF7                              BANKMASK(LATF), 7, a
#define LG0                              BANKMASK(LATG), 0, a
#define LG1                              BANKMASK(LATG), 1, a
#define LG2                              BANKMASK(LATG), 2, a
#define LG3                              BANKMASK(LATG), 3, a
#define LG4                              BANKMASK(LATG), 4, a
#define LH0                              BANKMASK(LATH), 0, a
#define LH1                              BANKMASK(LATH), 1, a
#define LH2                              BANKMASK(LATH), 2, a
#define LH3                              BANKMASK(LATH), 3, a
#define LH4                              BANKMASK(LATH), 4, a
#define LH5                              BANKMASK(LATH), 5, a
#define LH6                              BANKMASK(LATH), 6, a
#define LH7                              BANKMASK(LATH), 7, a
#define LINKIE                           BANKMASK(EIE), 4, b
#define LINKIF                           BANKMASK(EIR), 4, a
#define LJ0                              BANKMASK(LATJ), 0, a
#define LJ1                              BANKMASK(LATJ), 1, a
#define LJ2                              BANKMASK(LATJ), 2, a
#define LJ3                              BANKMASK(LATJ), 3, a
#define LJ4                              BANKMASK(LATJ), 4, a
#define LJ5                              BANKMASK(LATJ), 5, a
#define LJ6                              BANKMASK(LATJ), 6, a
#define LJ7                              BANKMASK(LATJ), 7, a
#define LVDIN                            BANKMASK(PORTA), 5, a
#define MARXEN                           BANKMASK(MACON1), 0, b
#define MCEN                             BANKMASK(ERXFCON), 1, b
#define MIIRD                            BANKMASK(MICMD), 0, b
#define MIISCAN                          BANKMASK(MICMD), 1, b
#define MPEN                             BANKMASK(ERXFCON), 3, b
#define MSK0                             BANKMASK(SSP1ADD), 0, a
#define MSK01                            BANKMASK(SSP1ADD), 0, a
#define MSK02                            BANKMASK(SSP2ADD), 0, a
#define MSK1                             BANKMASK(SSP1ADD), 1, a
#define MSK11                            BANKMASK(SSP1ADD), 1, a
#define MSK12                            BANKMASK(SSP2ADD), 1, a
#define MSK2                             BANKMASK(SSP1ADD), 2, a
#define MSK21                            BANKMASK(SSP1ADD), 2, a
#define MSK22                            BANKMASK(SSP2ADD), 2, a
#define MSK3                             BANKMASK(SSP1ADD), 3, a
#define MSK31                            BANKMASK(SSP1ADD), 3, a
#define MSK32                            BANKMASK(SSP2ADD), 3, a
#define MSK4                             BANKMASK(SSP1ADD), 4, a
#define MSK41                            BANKMASK(SSP1ADD), 4, a
#define MSK42                            BANKMASK(SSP2ADD), 4, a
#define MSK5                             BANKMASK(SSP1ADD), 5, a
#define MSK51                            BANKMASK(SSP1ADD), 5, a
#define MSK52                            BANKMASK(SSP2ADD), 5, a
#define MSK6                             BANKMASK(SSP1ADD), 6, a
#define MSK61                            BANKMASK(SSP1ADD), 6, a
#define MSK62                            BANKMASK(SSP2ADD), 6, a
#define MSK7                             BANKMASK(SSP1ADD), 7, a
#define MSK71                            BANKMASK(SSP1ADD), 7, a
#define MSK72                            BANKMASK(SSP2ADD), 7, a
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOT_A                            BANKMASK(SSP1STAT), 5, a
#define NOT_A2                           BANKMASK(SSP2STAT), 5, a
#define NOT_ADDRESS2                     BANKMASK(SSP2STAT), 5, a
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_CE                           BANKMASK(PORTJ), 5, a
#define NOT_CM                           BANKMASK(RCON), 5, a
#define NOT_CS                           BANKMASK(PORTE), 2, a
#define NOT_DONE                         BANKMASK(ADCON0), 1, a
#define NOT_LB                           BANKMASK(PORTJ), 6, a
#define NOT_OE                           BANKMASK(PORTJ), 1, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RD                           BANKMASK(PORTE), 0, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_SS                           BANKMASK(PORTF), 7, a
#define NOT_SS1                          BANKMASK(PORTF), 7, a
#define NOT_SS2                          BANKMASK(PORTD), 7, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_UB                           BANKMASK(PORTJ), 7, a
#define NOT_W                            BANKMASK(SSP1STAT), 2, a
#define NOT_W2                           BANKMASK(SSP2STAT), 2, a
#define NOT_WR                           BANKMASK(PORTE), 1, a
#define NOT_WRH                          BANKMASK(PORTJ), 3, a
#define NOT_WRITE2                       BANKMASK(SSP2STAT), 2, a
#define NOT_WRL                          BANKMASK(PORTJ), 2, a
#define NVALID                           BANKMASK(MISTAT), 2, b
#define OBF                              BANKMASK(PSPCON), 6, a
#define OE                               BANKMASK(PORTJ), 1, a
#define OERR                             BANKMASK(RCSTA1), 1, a
#define OERR1                            BANKMASK(RCSTA1), 1, a
#define OERR2                            BANKMASK(RCSTA2), 1, a
#define OSCFIE                           BANKMASK(PIE2), 7, a
#define OSCFIF                           BANKMASK(PIR2), 7, a
#define OSCFIP                           BANKMASK(IPR2), 7, a
#define OSTS                             BANKMASK(OSCCON), 3, a
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define P1DC0                            BANKMASK(ECCP1DEL), 0, a
#define P1DC1                            BANKMASK(ECCP1DEL), 1, a
#define P1DC2                            BANKMASK(ECCP1DEL), 2, a
#define P1DC3                            BANKMASK(ECCP1DEL), 3, a
#define P1DC4                            BANKMASK(ECCP1DEL), 4, a
#define P1DC5                            BANKMASK(ECCP1DEL), 5, a
#define P1DC6                            BANKMASK(ECCP1DEL), 6, a
#define P1M0                             BANKMASK(CCP1CON), 6, a
#define P1M1                             BANKMASK(CCP1CON), 7, a
#define P1RSEN                           BANKMASK(ECCP1DEL), 7, a
#define P2                               BANKMASK(SSP2STAT), 4, a
#define P2DC0                            BANKMASK(ECCP2DEL), 0, a
#define P2DC1                            BANKMASK(ECCP2DEL), 1, a
#define P2DC2                            BANKMASK(ECCP2DEL), 2, a
#define P2DC3                            BANKMASK(ECCP2DEL), 3, a
#define P2DC4                            BANKMASK(ECCP2DEL), 4, a
#define P2DC5                            BANKMASK(ECCP2DEL), 5, a
#define P2DC6                            BANKMASK(ECCP2DEL), 6, a
#define P2M0                             BANKMASK(CCP2CON), 6, a
#define P2M1                             BANKMASK(CCP2CON), 7, a
#define P2RSEN                           BANKMASK(ECCP2DEL), 7, a
#define P3DC0                            BANKMASK(ECCP3DEL), 0, a
#define P3DC1                            BANKMASK(ECCP3DEL), 1, a
#define P3DC2                            BANKMASK(ECCP3DEL), 2, a
#define P3DC3                            BANKMASK(ECCP3DEL), 3, a
#define P3DC4                            BANKMASK(ECCP3DEL), 4, a
#define P3DC5                            BANKMASK(ECCP3DEL), 5, a
#define P3DC6                            BANKMASK(ECCP3DEL), 6, a
#define P3M0                             BANKMASK(CCP3CON), 6, a
#define P3M1                             BANKMASK(CCP3CON), 7, a
#define P3RSEN                           BANKMASK(ECCP3DEL), 7, a
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
#define PA2E                             BANKMASK(PORTE), 7, a
#define PADCFG0                          BANKMASK(MACON3), 5, b
#define PADCFG1                          BANKMASK(MACON3), 6, b
#define PADCFG2                          BANKMASK(MACON3), 7, b
#define PASSALL                          BANKMASK(MACON1), 1, b
#define PB1                              BANKMASK(PORTH), 7, a
#define PB1E                             BANKMASK(PORTE), 6, a
#define PB2                              BANKMASK(PORTE), 2, a
#define PB3                              BANKMASK(PORTH), 5, a
#define PB3E                             BANKMASK(PORTE), 4, a
#define PC1                              BANKMASK(PORTH), 6, a
#define PC1E                             BANKMASK(PORTE), 5, a
#define PC2                              BANKMASK(PORTE), 1, a
#define PC3                              BANKMASK(PORTH), 4, a
#define PC3E                             BANKMASK(PORTE), 3, a
#define PCFG0                            BANKMASK(ADCON1), 0, a
#define PCFG1                            BANKMASK(ADCON1), 1, a
#define PCFG2                            BANKMASK(ADCON1), 2, a
#define PCFG3                            BANKMASK(ADCON1), 3, a
#define PD                               BANKMASK(RCON), 2, a
#define PD2                              BANKMASK(PORTE), 0, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN                              BANKMASK(SSP1CON2), 2, a
#define PEN1                             BANKMASK(SSP1CON2), 2, a
#define PEN2                             BANKMASK(SSP2CON2), 2, a
#define PGC                              BANKMASK(PORTB), 6, a
#define PGD                              BANKMASK(PORTB), 7, a
#define PHDREN                           BANKMASK(MACON3), 3, b
#define PHYRDY                           BANKMASK(ESTAT), 0, b
#define PKTDEC                           BANKMASK(ECON2), 6, b
#define PKTIE                            BANKMASK(EIE), 6, b
#define PKTIF                            BANKMASK(EIR), 6, a
#define PLLEN                            BANKMASK(OSCTUNE), 6, a
#define PMEN                             BANKMASK(ERXFCON), 4, b
#define POR                              BANKMASK(RCON), 1, a
#define PPRE                             BANKMASK(OSCTUNE), 4, a
#define PPST0                            BANKMASK(OSCTUNE), 5, a
#define PPST1                            BANKMASK(OSCTUNE), 7, a
#define PSA                              BANKMASK(T0CON), 3, a
#define PSP0                             BANKMASK(PORTD), 0, a
#define PSP1                             BANKMASK(PORTD), 1, a
#define PSP2                             BANKMASK(PORTD), 2, a
#define PSP3                             BANKMASK(PORTD), 3, a
#define PSP4                             BANKMASK(PORTD), 4, a
#define PSP5                             BANKMASK(PORTD), 5, a
#define PSP6                             BANKMASK(PORTD), 6, a
#define PSP7                             BANKMASK(PORTD), 7, a
#define PSPIE                            BANKMASK(PIE1), 7, a
#define PSPIF                            BANKMASK(PIR1), 7, a
#define PSPIP                            BANKMASK(IPR1), 7, a
#define PSPMODE                          BANKMASK(PSPCON), 4, a
#define PSS1AC0                          BANKMASK(ECCP1AS), 2, a
#define PSS1AC1                          BANKMASK(ECCP1AS), 3, a
#define PSS1BD0                          BANKMASK(ECCP1AS), 0, a
#define PSS1BD1                          BANKMASK(ECCP1AS), 1, a
#define PSS2AC0                          BANKMASK(ECCP2AS), 2, a
#define PSS2AC1                          BANKMASK(ECCP2AS), 3, a
#define PSS2BD0                          BANKMASK(ECCP2AS), 0, a
#define PSS2BD1                          BANKMASK(ECCP2AS), 1, a
#define PSS3AC0                          BANKMASK(ECCP3AS), 2, a
#define PSS3AC1                          BANKMASK(ECCP3AS), 3, a
#define PSS3BD0                          BANKMASK(ECCP3AS), 0, a
#define PSS3BD1                          BANKMASK(ECCP3AS), 1, a
#define RA0                              BANKMASK(PORTA), 0, a
#define RA1                              BANKMASK(PORTA), 1, a
#define RA2                              BANKMASK(PORTA), 2, a
#define RA3                              BANKMASK(PORTA), 3, a
#define RA4                              BANKMASK(PORTA), 4, a
#define RA5                              BANKMASK(PORTA), 5, a
#define RA7                              BANKMASK(PORTA), 7, a
#define RB0                              BANKMASK(PORTB), 0, a
#define RB1                              BANKMASK(PORTB), 1, a
#define RB2                              BANKMASK(PORTB), 2, a
#define RB3                              BANKMASK(PORTB), 3, a
#define RB4                              BANKMASK(PORTB), 4, a
#define RB5                              BANKMASK(PORTB), 5, a
#define RB6                              BANKMASK(PORTB), 6, a
#define RB7                              BANKMASK(PORTB), 7, a
#define RBIE                             BANKMASK(INTCON), 3, a
#define RBIF                             BANKMASK(INTCON), 0, a
#define RBIP                             BANKMASK(INTCON2), 0, a
#define RBPU                             BANKMASK(INTCON2), 7, a
#define RC0                              BANKMASK(PORTC), 0, a
